Ran Plan for dir: `project1` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket2"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket2" -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket2" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket2" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:48:33.270Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:48:33.270Z" -> null
      - url                         = "gs://bucket-geeta13-bucket2" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:48:33.270Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }
  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket3" -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket3" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket3" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:48:35.436Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:48:35.436Z" -> null
      - url                         = "gs://bucket-geeta13-bucket3" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:48:35.436Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }
  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket1" -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket1" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket1" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:48:34.346Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:48:34.346Z" -> null
      - url                         = "gs://bucket-geeta13-bucket1" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:48:34.346Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket2"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket3"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://2f27ca24d7f6:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project1`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
